from flask import jsonify

temple = [
  {
    'id': 1,
    'temple_name': 'អង្គរវត្ត',
    'temple_image': 'https://ohhcambodia.com/wp-content/uploads/2019/07/angkor-wat-temple-934094_1280.jpg',
    'temple_detail': {
      'temple_name': 'អង្គរវត្ត',
      'temple_image': 'https://ohhcambodia.com/wp-content/uploads/2019/07/angkor-wat-temple-934094_1280.jpg',
      'description': 'ប្រាសាទអង្គរវត្ត គឺជាប្រាសាទសាសនាដ៏ធំបំផុតក្នុងពិភពលោក និងជាប្រាសាទដ៏ល្បីល្បាញបំផុតនៅក្នុងប្រទេសកម្ពុជា ដែលដើមឡើយត្រូវបានសាងសង់ឡើងក្នុងសតវត្សទី 12 ។ វាជាសម្បត្តិបេតិកភណ្ឌពិភពលោករបស់អង្គការយូណេស្កូ និងជានិមិត្តរូបនៃប្រវត្តិសាស្ត្រ និងវប្បធម៌ដ៏សម្បូរបែបរបស់កម្ពុជា។ ប្រាសាទនេះត្រូវបានឧទ្ទិសដល់ព្រះវិស្ណុរបស់ហិណ្ឌូ ប៉ុន្តែក្រោយមកបានក្លាយជាប្រាសាទព្រះពុទ្ធសាសនា។',
      'location': 'សៀមរាប ប្រទេសកម្ពុជា',
      'notableFeature': 'ចម្លាក់លៀនបាសគួរឱ្យភ្ញាក់ផ្អើលដែលពណ៌នាអំពីទេវកថាហិណ្ឌូ និងឈុតប្រវត្តិសាស្ត្រ។ ប្រាង្គកណ្តាលរបស់ប្រាសាទ គឺជានិមិត្តរូបនៃភ្នំព្រះសុមេរុ ដែលជាមជ្ឈមណ្ឌលនៃចក្រវាឡហិណ្ឌូ។ កន្លែងពេញនិយមសម្រាប់ការថតរូបថ្ងៃរះ និងថ្ងៃលិច។',
    }
  },
  {
    'id': 2,
    'temple_name': 'ប្រាសាទបាយ័ន',
    'temple_image': 'https://visitcambodia.travel/upload/files/resized/vuth_1558941874_59207_70449.jpeg',
    'temple_detail': {
      'temple_name': 'ប្រាសាទបាយ័ន',
      'temple_image': 'https://visitcambodia.travel/upload/files/resized/vuth_1558941874_59207_70449.jpeg',
      'description': 'ប្រាសាទបាយ័ន ត្រូវបានគេស្គាល់ថាជាប្រាសាទថ្មដ៏ស្ងប់ស្ងាត់ និងដ៏ធំនៃព្រះអវឡោគីត្យវរ៉ា ដែលជាព្រះពោធិសត្វ ដែលនៅរាយប៉ាយពាសពេញប្រាង្គប្រាសាទ។ វាត្រូវបានសាងសង់ឡើងនៅចុងសតវត្សរ៍ទី 12 ជាប្រាសាទរដ្ឋរបស់ព្រះបាទជ័យវរ្ម័នទី 7 ហើយវាមានចម្លាក់ថ្មប៉ប្រះទឹកយ៉ាងប្រណិត។',
      'location': 'អង្គរធំ ខេត្តសៀមរាប ប្រទេសកម្ពុជា។',
      'notableFeature': 'មុខថ្មជាង 200 ដែលភាគច្រើនគិតថាតំណាងឱ្យស្តេចខ្លួនឯង។ ចម្លាក់លៀនប្រណិតដែលបង្ហាញពីជីវិតប្រចាំថ្ងៃក្នុងអាណាចក្រខ្មែរ។ ស្ថិតនៅចំកណ្តាលក្រុងអង្គរធំ ដែលជារាជធានីបុរាណនៃអាណាចក្រខ្មែរ។',
    }
  },
  {
    'id': 3,
    'temple_name': 'តាព្រហ្ម',
    'temple_image': 'https://upload.wikimedia.org/wikipedia/commons/f/f8/Taprohm-2007-11-02.JPG',
    'temple_detail': {
      'temple_name': 'តាព្រហ្ម',
      'temple_image': 'https://upload.wikimedia.org/wikipedia/commons/f/f8/Taprohm-2007-11-02.JPG',
      'description': 'ប្រាសាទតាព្រហ្មល្បីល្បាញដោយសារដើមឈើធំៗដុះចេញពីប្រាសាទ ប្រាសាទតាព្រហ្ម ជាប្រាសាទឧទ្ទិសដល់ព្រះពុទ្ធ។ វាត្រូវបានសាងសង់ឡើងនៅចុងសតវត្សរ៍ទី 12 ហើយនៅតែជាប្រាសាទដ៏ពេញនិយមបំផុតមួយនៅក្នុងអង្គរ ដោយសាររូបរាងដ៏រ៉ូមែនទិក និងដើមរបស់វា។',
      'location': 'សៀមរាប ប្រទេសកម្ពុជា។',
      'notableFeature': 'ប្រាសាទនេះត្រូវបានបង្ហាញនៅក្នុងខ្សែភាពយន្ត Tomb Raider ។ ឫសមែកធាងយក្សប្រទាក់ក្រឡាគ្នាជាមួយប្រាសាទ បង្កើតបរិយាកាសប្លែក និងគួរឲ្យខ្លាច។ ដើមឡើយឧទ្ទិសថ្វាយដល់ព្រះមាតារបស់ព្រះបាទជ័យវរ្ម័នទី៧។',
    }
  },
  {
    'id': 4,
    'temple_name': 'ប្រាសាទព្រះវិហារ',
    'temple_image': 'https://media.brandbodia.com/wp-content/uploads/2021/07/%E1%9E%94%E1%9F%92%E1%9E%9A%E1%9E%9F%E1%9E%B6%E1%9E%91%E1%9E%96%E1%9F%92%E1%9E%9A%E1%9F%87%E1%9E%9C%E1%9E%B7%E1%9E%A0%E1%9E%B6%E1%9E%9A.jpg',
    'temple_detail': {
      'temple_name': 'ប្រាសាទព្រះវិហារ',
      'temple_image': 'https://media.brandbodia.com/wp-content/uploads/2021/07/%E1%9E%94%E1%9F%92%E1%9E%9A%E1%9E%9F%E1%9E%B6%E1%9E%91%E1%9E%96%E1%9F%92%E1%9E%9A%E1%9F%87%E1%9E%9C%E1%9E%B7%E1%9E%A0%E1%9E%B6%E1%9E%9A.jpg',
      'description': 'ប្រាសាទព្រះវិហារគឺជាប្រាសាទហិណ្ឌូដែលឧទ្ទិសដល់ព្រះសិវៈ ហើយវាផ្តល់នូវទិដ្ឋភាពបែប Panoramic នៃវាលទំនាបជុំវិញ។ វាគួរឱ្យកត់សម្គាល់សម្រាប់ប្លង់ស្ថាបត្យកម្មតែមួយគត់របស់វា ដែលលាតសន្ធឹងតាមជួរភ្នំធម្មជាតិ ដែលធ្វើឱ្យវាក្លាយជាស្នាដៃដ៏អស្ចារ្យនៃវិស្វកម្ម។',
      'location': 'ខេត្តព្រះវិហារ ប្រទេសកម្ពុជា (ជិតព្រំដែនថៃ)។',
      'notableFeature': 'បេតិកភណ្ឌពិភពលោករបស់អង្គការយូណេស្កូ។ ទីតាំងដ៏អស្ចារ្យនៅលើច្រាំងថ្មចោទខ្ពស់ ផ្តល់នូវទិដ្ឋភាពដ៏អស្ចារ្យ។ ស៊េរីនៃផ្ទៃរាបស្មើ និងវិចិត្រសាលដែលនាំទៅដល់ប្រាសាទនៅឯកំពូលភ្នំ។',
    }
  },
  {
    'id': 5,
    'temple_name': 'វត្តភ្នំ',
    'temple_image': 'https://asset.tovtrip.com//uploads/0000/107/2023/03/03/photo-2023-03-03-11-51-29.jpg',
    'temple_detail': {
      'temple_name': 'វត្តភ្នំ',
      'temple_image': 'https://asset.tovtrip.com//uploads/0000/107/2023/03/03/photo-2023-03-03-11-51-29.jpg',
      'description': 'វត្តភ្នំ ជាប្រាសាទពុទ្ធសាសនា ស្ថិតនៅលើភ្នំមួយ ចំកណ្តាលទីក្រុងភ្នំពេញ រាជធានីនៃប្រទេសកម្ពុជា។ វាត្រូវបានបង្កើតឡើងក្នុងឆ្នាំ 1373 ហើយជាប្រាសាទចំណាស់ជាងគេមួយនៅក្នុងទីក្រុង។ ប្រាសាទ​នេះ​ត្រូវ​បាន​ឧទ្ទិស​ដល់​ព្រះពុទ្ធ ហើយ​ត្រូវ​បាន​គេ​ជឿ​ថា​ជា​កន្លែង​ដែល​ទីក្រុង​ភ្នំពេញ​បាន​ទទួល​ឈ្មោះ​របស់​ខ្លួន។',
      'location': 'ភ្នំពេញ ប្រទេសកម្ពុជា។',
      'notableFeature': 'ប្រាសាទ​នេះ​ស្ថិត​នៅ​លើ​ភ្នំ​កម្ពស់ ២៧ ម៉ែត្រ និង​ផ្តល់​នូវ​ទិដ្ឋភាព​នៃ​ទីក្រុង។ ផ្ទះមានរូបសំណាកព្រះពុទ្ធ និងជាកន្លែងធម្មយាត្រាដ៏ពេញនិយម។ តំបន់ជុំវិញមានសួនច្បារ ហាងទំនិញ និងបរិយាកាសស្ងប់ស្ងាត់សម្រាប់ភ្ញៀវទេសចរ។',
    }
  }
  
]

def get_temple():
  response = {
        "status": 200,
        "message": "Temple retrieved successfully",
        "data": temple,
    }
  return jsonify(response)